{
  "navbar.home": "Home",
  "navbar.about": "About me",
  "navbar.projects": "Projects",
  "navbar.skills": "Skills",
  "navbar.contact": "Contact",
  "navbar.resume": "Resume",
  "navbar.tema": "Select a theme",
  "navbar.tema.ligth": "Light",
  "navbar.tema.oscuro": "Dark",
  "navbar.tema.JoaRod": "JoaRod",
  "navbar.language": "Select a language",
  "hero.name": "Joaquin Rodríguez",
  "hero.profession": "Data Science Technician & .NET/NEST Backend Developer",
  "hero.description": "I am a Data Science Technician with a strong background in data analysis, modeling, and management, graduated from Teclab Instituto Técnico Superior in partnership with Amazon Web Services (AWS). My approach combines data analytics with backend development, leveraging the .NET, Azure, and Node.js ecosystems to build intelligent, scalable, and automation-driven solutions. I have experience in Machine Learning, ETL processes, NLP, and data visualization, as well as skills in Docker, cloud computing, and relational and non-relational databases. My professional goal is to integrate data science with software development to create tools that turn information into strategic decisions.",
  "hero.button.proyects": "Projects",
  "hero.button.resume": "Resume",
  "aboutme.title": "About me",
  "aboutme.description": "I am passionate about data analysis and artificial intelligence with experience in creating innovative solutions to solve complex problems. I specialize in developing predictive models, statistical analysis, and data visualization to help companies make informed decisions. My goal is to continue growing professionally and contribute to the advancement of data science by applying advanced techniques and continuous learning.",
  "aboutme.experience.title": "Which experience do you want to check?",
  "aboutme.card.brain.title": "Critical Thinking",
  "aboutme.card.brain.description": "Logical reasoning and critical thinking in complex contexts.",
  "aboutme.card.chart.title": "Analyst",
  "aboutme.card.chart.description": "I analyze data from multiple angles to identify significant patterns and trends.",
  "aboutme.card.lighbulb.title": "Curiosity",
  "aboutme.card.lighbulb.description": "I am always looking for new ways to learn and apply innovative techniques/tools.",
  "aboutme.experience.button.professional": "Professional",
  "aboutme.experience.button.academic": "Education",
  "aboutme.experience.profesional": [
    {
      "year": "Oct. 2024 - Present",
      "title": "Backend Developer",
      "company": "Micracel / Microtrack",
      "description": "I develop and maintain backend applications applying clean architecture principles and best development practices. I manage and optimize SQL Server databases, performing modeling, query optimization, and index administration to improve performance. I implement cloud services with Azure and carry out integrations of APIs and web services, ensuring the interoperability and scalability of the solutions. I ensure compliance with security standards through access control, encryption, and audits. I collaborate with multidisciplinary teams in the planning, technical analysis, and deployment of software in production environments."
    },
    {
      "year": "Oct. 2023 - Sept. 2025",
      "title": "Full Stack Developer Career Tutor.",
      "company": "Coderhouse.",
      "description": "I serve as a tutor for the Full Stack Developer career, accompanying students in their learning process. I guide and support students in understanding complex concepts, providing constructive feedback and detailed project reviews. I develop complementary educational materials and resources to enrich the learning experience. Additionally, I coordinate live sessions and practical workshops, promoting active participation and collaboration among students."
    },
    {
      "year": "Dec. 2023 - May 2024",
      "title": "Junior Backend Developer.",
      "company": "RST Argentina.",
      "description": "As a backend developer, I participated in the design, development, and maintenance of scalable services and systems. I developed and maintained RESTful APIs with Node.js and Nest.js to support web applications and servers. I managed relational and non-relational databases, ensuring data integrity and efficiency. I implemented secure and scalable servers, performed integrations with microservices and external services, and optimized application performance through best programming practices and exhaustive testing. I collaborated with cross-functional teams applying agile methodologies to ensure timely and high-quality deliveries."
    },
    {
      "year": "Dec. 2022 - Dec. 2023",
      "title": "Freelance Web Developer.",
      "company": "Freelance.",
      "description": "I collaborate with various clients in the development and deployment of custom web applications using modern libraries like React.js. I design and build intuitive and responsive user interfaces, prioritizing the user experience. I implement solutions based on artificial intelligence to optimize processes and improve interaction with applications. I manage the complete development cycle, from requirements gathering to deployment and post-launch maintenance. I maintain constant communication with clients to ensure satisfaction and the achievement of each project's objectives."
    }
  ],
  "aboutme.experience.formacion": [
    {
      "year": "2023 - 2025",
      "title": "Higher Technician in Data Science.",
      "company": "Teclab Higher Technical Institute",
      "description": "I started the Data Science career due to my great interest in the world of data. Thanks to the knowledge provided by the Teclab institute's program, I will be able to analyze and explore data, discovering relevant insights and formulating hypotheses. I will use specialized tools to process data, perform exploratory analysis, and train predictive models. Additionally, I will work with large volumes of data, applying specific programming languages. I will use cloud services to process data, train models, and generate predictions. I will also manage Big Data databases with processing technologies. My skill set includes solid mathematical and statistical knowledge, which I will apply effectively for agile decision-making and effective solutions."
    },
    {
      "year": "2022 - 2023",
      "title": "Full Stack Developer Career.",
      "company": "Coderhouse.",
      "description": "Through this career, I have mastered the powerful MERN Stack (MongoDB, Express, React.js, and Node.js). This has enabled me to create modern and scalable web applications, from the database to the user interface, using cutting-edge technologies. At Coderhouse, the focus on practical projects has been fundamental; I have had the opportunity to apply my knowledge in real projects, which has helped me consolidate my skills and build a solid portfolio. This career has given me access to expert professionals who have guided me every step of the way. Furthermore, the Coderhouse community is a constant source of inspiration and shared learning."
    },
    {
      "year": "2015 - 2020",
      "title": "Technician in Electricity.",
      "company": "Technical College 'San José'.",
      "description": "At the technical college, I learned to install, repair, and maintain electrical systems, mastering theoretical and practical knowledge of circuits, load calculations, use of measuring instruments, safety regulations, and electrical plans. In the training, I learned about residential and commercial installations, as well as, in some cases, industrial electricity with control, programming, and automation systems."
    }
  ],
  "contact.title": "Contact",
  "contact.description": "Do you have any questions or a project where I can add value? Don't hesitate to contact me.",
  "contact.title.link": "Get in touch.",
  "contact.form.name": "Name",
  "contact.form.email": "Email",
  "contact.form.message": "Message...",
  "contact.form.buttom": "Send Message",
  "contact.form.success": "Message sent successfully!",
  "contact.form.error": "There was an error sending the message. Please try again.",
  "contact.form.buttom.submitted": "Sent!",
  "project.title": "Projects",
  "project.subtitle": "My collection of projects, a glimpse into my professional work...",
  "project.filter.title": "Filter Projects",
  "project.filter.searchPlaceholder": "Search by name...",
  "project.filter.filterBy": "Filter by",
  "project.filter.withDeploy": "With Deploy",
  "project.filter.withGithub": "With GitHub",
  "project.filter.technologies": "Technologies",
  "project.filter.reset": "Reset",
  "project.filter.apply": "Apply Filters",
  "project.card.demo": "Demo",
  "project.card.code": "Code",
  "project.card.more": "More Details",
  "project.card.close": "Close",
  "project.card.github": "Star on Github",
  "skills.title": "Skills and Certifications",
  "skills.tech.title": "Tech Skills",
  "skills.soft.title": "Soft Skills",
  "skills.soft.skill1": "Creative Thinking",
  "skills.soft.skill2": "Adaptability",
  "skills.soft.skill3": "Continuous Learning",
  "skills.soft.skill4": "Collaboration",
  "skills.soft.skill5": "Time Management",
  "skills.soft.skill6": "Assertiveness",
  "skills.soft.skill7": "Innovation",
  "skills.soft.skill8": "Resilience",
  "skills.soft.skill9": "Flexibility",
  "skills.soft.skill10": "Organization",
  "skills.certs.title": "Certifications",
  "project.button.text": "View all my projects...",
  "404.title": "Page not found",
  "404.description": "Back to home",
  "aboutme.experience": "",
  "navbar.download": "Download CV",
  "modal.language": "Select your language",
  "language.spanish": "Spanish",
  "language.english": "English",
  "contact.name": "Name",
  "contact.email": "Email",
  "contact.message": "Message",
  "contact.send": "Send",
  "tour.home.title": "Home",
  "tour.home.description": "This is the main page, where you can find an introduction about me.",
  "tour.projects.title": "Projects",
  "tour.projects.description": "Here you can see all my projects. Check them out!",
  "tour.contact.title": "Contact",
  "tour.contact.description": "If you want to contact me, this is the section to go to.",
  "tour.resume.title": "Resume",
  "tour.resume.description": "Here you can find my detailed resume.",
  "tour.settings.title": "Settings",
  "tour.settings.description": "Here you can change the language and theme of the website.",
  "tour.hero_title.title": "Hello!",
  "tour.hero_title.description": "This is my name and my profession.",
  "tour.hero_buttons.title": "Action Buttons",
  "tour.hero_buttons.description": "These buttons will take you to my projects and my resume.",
  "tour.social_buttons.title": "Contact",
  "tour.social_buttons.description": "These buttons will direct you to my contact methods",
  "tour.filter_button.title": "Filter Projects",
  "tour.filter_button.description": "Use this button to filter projects by technology, name, etc.",
  "tour.modal.title": "Welcome!",
  "tour.modal.description": "Would you like to take a tour to learn about the site's features?",
  "tour.modal.start": "Start Tour",
  "tour.modal.skip": "Skip"
}
