{
  "navbar.home": "Inicio",
  "navbar.about": "Sobre mi",
  "navbar.projects": "Proyectos",
  "navbar.skills": "Habilidades",
  "navbar.contact": "Contacto",
  "navbar.resume": "Resumen",
  "navbar.tema": "Selecciona un tema",
  "navbar.tema.ligth": "Claro",
  "navbar.tema.oscuro": "Oscuro",
  "navbar.tema.JoaRod": "JoaRod",
  "navbar.language": "Selecciona un idioma",
  "hero.name": "Joaquin Rodríguez",
  "hero.profession": "Técnico en Ciencias de Datos & Desarrollador Backend .NET/NEST",
  "hero.description": "Soy Técnico Superior en Ciencia de Datos, con una sólida formación en análisis, modelado y gestión de datos, egresado de Teclab Instituto Técnico Superior en asociación con Amazon Web Services (AWS). Mi enfoque combina la analítica de datos con el desarrollo backend, aplicando tecnologías del ecosistema .NET, Azure y Node.js para construir soluciones inteligentes, escalables y orientadas a la automatización. Cuento con experiencia en Machine Learning, procesos ETL, NLP y visualización de datos, junto con habilidades en Docker, cloud computing y bases de datos relacionales y no relacionales. Mi objetivo profesional es integrar la ciencia de datos con el desarrollo de software para crear herramientas que transformen información en decisiones estratégicas.",
  "hero.button.proyects": "Proyectos",
  "hero.button.resume": "Resumen",
  "aboutme.title": "Sobre mí",
  "aboutme.description": "Soy un apasionado del análisis de datos y la inteligencia artificial con experiencia en la creación de soluciones innovadoras para resolver problemas complejos. Me especializo en el desarrollo de modelos predictivos, análisis estadístico y visualización de datos para ayudar a las empresas a tomar decisiones informadas. Mi objetivo es seguir creciendo profesionalmente y contribuir al avance de la ciencia de datos mediante la aplicación de técnicas avanzadas y el aprendizaje continuo.",
  "aboutme.experience.title": "¿Qué experiencia quieres consultar?",
  "aboutme.card.brain.title": "Pensamiento Crítico",
  "aboutme.card.brain.description": "Razonamiento lógico y pensamiento crítico en contextos complejos.",
  "aboutme.card.chart.title": "Analista",
  "aboutme.card.chart.description": "Analizo datos desde múltiples ángulos para identificar patrones y tendencias significativas.",
  "aboutme.card.lighbulb.title": "Curiosidad",
  "aboutme.card.lighbulb.description": "Siempre estoy buscando nuevas formas de aprender y aplicar técnicas/herramientas innovadoras.",
  "aboutme.experience.button.professional": "Profesional",
  "aboutme.experience.button.academic": "Formación",
  "aboutme.experience.profesional": [
    {
      "year": "oct. 2024 - Presente",
      "title": "Desarrollador Backend",
      "company": "Micracel / Microtrack",
      "description": "Desarrollo y mantengo aplicaciones backend aplicando principios de arquitectura limpia y buenas prácticas de desarrollo. Gestiono y optimizo bases de datos SQL Server, realizando modelado, optimización de consultas y administración de índices para mejorar el rendimiento. Implemento servicios en la nube con Azure y realizo integraciones de APIs y servicios web, garantizando la interoperabilidad y escalabilidad de las soluciones. Aseguro el cumplimiento de estándares de seguridad mediante control de acceso, cifrado y auditorías. Colaboro con equipos multidisciplinarios en la planificación, análisis técnico y despliegue de software en entornos productivos."
    },
    {
      "year": "oct. 2023 - sept. 2025",
      "title": "Tutor de la Carrera Desarrollador Full Stack.",
      "company": "Coderhouse.",
      "description": "Desempeño el rol de tutor en la carrera de Desarrollador Full Stack, acompañando a estudiantes en su proceso de aprendizaje. Guío y apoyo a los alumnos en la comprensión de conceptos complejos, brindando feedback constructivo y revisiones detalladas de proyectos. Desarrollo materiales y recursos educativos complementarios para enriquecer la experiencia de aprendizaje. Además, coordino sesiones en vivo y talleres prácticos, fomentando la participación activa y la colaboración entre estudiantes."
    },
    {
      "year": "dic. 2023 - may. 2024",
      "title": "Desarrollador Backend Junior.",
      "company": "RST Argentina.",
      "description": "Como desarrollador backend participé en el diseño, desarrollo y mantenimiento de servicios y sistemas escalables. Desarrollé y mantuve API RESTful con Node.js y Nest.js para soportar aplicaciones web y servidores. Administré bases de datos relacionales y no relacionales asegurando la integridad y eficiencia de los datos. Implementé servidores seguros y escalables, realicé integraciones con microservicios y servicios externos, y optimicé el rendimiento de las aplicaciones mediante buenas prácticas de programación y pruebas exhaustivas. Colaboré con equipos multifuncionales aplicando metodologías ágiles para garantizar entregas puntuales y de alta calidad."
    },
    {
      "year": "dic. 2022 - dic. 2023",
      "title": "Desarrollador Web Freelance.",
      "company": "Autónomo.",
      "description": "Colaboro con diversos clientes en el desarrollo y despliegue de aplicaciones web personalizadas utilizando librerías modernas como React.js. Diseño y construyo interfaces de usuario intuitivas y responsivas, priorizando la experiencia del usuario. Implemento soluciones basadas en inteligencia artificial para optimizar procesos y mejorar la interacción con las aplicaciones. Gestiono el ciclo completo de desarrollo, desde la toma de requisitos hasta el despliegue y mantenimiento post-lanzamiento. Mantengo una comunicación constante con los clientes para garantizar la satisfacción y el cumplimiento de los objetivos de cada proyecto."
    }
  ],
  "aboutme.experience.formacion": [
    {
      "year": "2023 - 2025",
      "title": "Técnico Superior en Ciencia de Datos.",
      "company": "Instituto Técnico Superior Teclab",
      "description": "Empecé la carrera de Data Science por mi gran interés en el universo de los datos, gracias a los conocimientos de la carrera que brinda el instituto Teclab podré analizar y explorar datos, descubriendo ideas relevantes y formulando hipótesis. Utilizar herramientas especializadas para procesar datos, realizar análisis exploratorios y entrenar modelos predictivos. Además, trabajaré con grandes volúmenes de datos, aplicando lenguajes de programación específicos. Utilizaré servicios en la nube para procesar datos, entrenar modelos y generar predicciones. También gestionaré bases de datos de Big Data con tecnologías de procesamiento. Mi conjunto de habilidades incluye sólidos conocimientos matemáticos y estadísticos, que aplicaré eficazmente para la toma de decisiones ágiles y soluciones efectivas."
    },
    {
      "year": "2022 - 2023",
      "title": "Carrera Desarrollador Full Stack.",
      "company": "Coderhouse.",
      "description": "A través de esta carrera, he dominado el potente Stack MERN (MongoDB, Express, React.js y Node.js). Esto me ha capacitado para crear aplicaciones web modernas y escalables, desde la base de datos hasta la interfaz de usuario, utilizando tecnologías de vanguardia. En Coderhouse, el enfoque en proyectos prácticos ha sido fundamental, he tenido la oportunidad de aplicar mis conocimientos en proyectos reales, lo que me ha ayudado a consolidar mis habilidades y construir un sólido portafolio. Esta carrera me ha brindado acceso a profes expertos que me han guiado en cada paso del camino. Además, la comunidad de Coderhouse es una fuente constante de inspiración y aprendizaje compartido."
    },
    {
      "year": "2015 - 2020",
      "title": "Técnico En Electricidad.",
      "company": "Colegio Técnico 'San José'.",
      "description": "En el colegio técnico aprendí a instalar, reparar y mantener sistemas eléctricos, dominando conocimientos teóricos y prácticos sobre circuitos cálculo de cargas, uso de instrumentos de medición, normativas de seguridad y planos eléctricos. En la formación aprendí sobre instalaciones domiciliarias y comerciales como, en algunos casos, la electricidad industrial con sistemas de control, programación y automatización."
    }
  ],
  "contact.title": "Contacto",
  "contact.description": "¿Tienes alguna pregunta o tienes algun proyecto al que pueda sumar valor? No dudes en contactarme.",
  "contact.title.link": "Ponte en contacto.",
  "contact.form.name": "Nombre",
  "contact.form.email": "Email",
  "contact.form.message": "Mensaje...",
  "contact.form.buttom": "Enviar Mensaje",
  "contact.form.success": "¡Mensaje enviado con éxito!",
  "contact.form.error": "Hubo un error al enviar el mensaje. Inténtalo de nuevo.",
  "contact.form.buttom.submitted": "Enviado!",
  "project.title": "Proyectos",
  "project.subtitle": "Mi colección de proyectos, un vistazo a mi trabajo profesional...",
  "project.filter.title": "Filtrar Proyectos",
  "project.filter.searchPlaceholder": "Buscar por nombre...",
  "project.filter.filterBy": "Filtrar por",
  "project.filter.withDeploy": "Con Deploy",
  "project.filter.withGithub": "Con GitHub",
  "project.filter.technologies": "Tecnologías",
  "project.filter.reset": "Resetear",
  "project.filter.apply": "Aplicar Filtros",
  "project.card.demo": "Demo",
  "project.card.code": "Código",
  "project.card.more": "Mas Detalles",
  "project.card.close": "Cerrar",
  "project.card.github": "Estrella en Github",
  "skills.title": "Habilidades y Certificaciones",
  "skills.tech.title": "Tech Skills",
  "skills.soft.title": "Soft Skills",
  "skills.soft.skill1": "Pensamiento Creativo",
  "skills.soft.skill2": "Adaptabilidad",
  "skills.soft.skill3": "Aprendizaje continuo",
  "skills.soft.skill4": "Colaboración",
  "skills.soft.skill5": "Gestión de tiempo",
  "skills.soft.skill6": "Asertividad",
  "skills.soft.skill7": "Innovación",
  "skills.soft.skill8": "Resiliencia",
  "skills.soft.skill9": "Flexibilidad",
  "skills.soft.skill10": "Organización",
  "skills.certs.title": "Certificaciones",
  "project.button.text": "Ver todos mis proyectos...",
  "404.title": "Página no encontrada",
  "404.description": "Volver al inicio",
  "aboutme.experience": "",
  "navbar.download": "Descargar CV",
  "modal.language": "Selecciona tu idioma",
  "language.spanish": "Español",
  "language.english": "Inglés",
  "tour.home.title": "Inicio",
  "tour.home.description": "Esta es la página principal, donde puedes encontrar una introducción sobre mí.",
  "tour.projects.title": "Proyectos",
  "tour.projects.description": "Aquí puedes ver todos mis proyectos. ¡Échales un vistazo!",
  "tour.contact.title": "Contacto",
  "tour.contact.description": "Si quieres contactarme, esta es la sección a la que debes ir.",
  "tour.resume.title": "CV",
  "tour.resume.description": "Aquí puedes encontrar mi currículum detallado.",
  "tour.settings.title": "Configuración",
  "tour.settings.description": "Aquí puedes cambiar el idioma y el tema del sitio web.",
  "tour.hero_title.title": "¡Hola!",
  "tour.hero_title.description": "Este es mi nombre y mi profesión.",
  "tour.hero_buttons.title": "Botones de Acción",
  "tour.hero_buttons.description": "Estos botones te llevarán a mis proyectos y a mi currículum.",
  "tour.social_buttons.title": "Contacto",
  "tour.social_buttons.description": "Estos botones te derivarán a mis medios de contacto",
  "tour.filter_button.title": "Filtrar Proyectos",
  "tour.filter_button.description": "Usa este botón para filtrar los proyectos por tecnología, nombre, etc.",
  "tour.modal.title": "¡Bienvenido!",
  "tour.modal.description": "¿Te gustaría hacer un tour para conocer las funcionalidades del sitio?",
  "tour.modal.start": "Comenzar Tour",
  "tour.modal.skip": "Saltar",
  "agent.modal.title": "Coloca tu API Key",
  "agent.modal.selector.text": "Selecciona tu proveedor:",
  "agent.modal.button.text": "Guardar",
  "agent.button.normalMode": "Modo Normal",
  "agent.chat.input.text": "Consultar sobre proyectos, certificados, formación, etc...",
  "agent.chat.button.text": "Enviar",
  "agent.chat.provider": "Porfavor coloca una API KEY para iniciar el agente.",
  "agent.modal.tooltip": "Tu API key se usa únicamente desde tu navegador para conectarte con el modelo de IA. No se guarda, no se comparte y no sale de tu dispositivo.",
  "tour.agent_mode.title": "Modo Agente",
  "tour.agent_mode.description": "Haz clic aquí para activar el modo agente e interactuar con un asistente de IA."
}
